tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"

brew "ca-certificates"
brew "asdf"
brew "sqlite"
brew "cmake"
brew "ctags"
brew "gcc"
brew "gh"
brew "git"
brew "lazygit"
brew "luajit"
brew "make"
brew "neovim"
brew "postgresql@14", restart_service: true
brew "ripgrep"
brew "stow"
brew "vim"
brew "vips"
brew "wimlib"
brew "zellij"
brew "go-task"
brew "oh-my-posh""

cask "1password-cli"
cask "alacritty"
cask "anytype"
cask "chatgpt"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "postman"
cask "raycast"
cask "zed"
cask "visual-studio-code"
