# Development Languages and Version Managers
brew 'asdf'      # Extendable version manager
brew 'fnm'       # Fast Node.js version manager
brew 'gcc'       # GNU compiler collection

# Development Tools
brew 'amalgo'    # Tool for amalgamating C/C++ source files
brew 'cmake'     # Cross-platform make
brew 'ctags'     # Generates tag files for source code
brew 'gettext'   # GNU internationalization (i18n) and localization (l10n) library
brew 'make'      # Utility for directing compilation
brew 'pkgconf'   # Package compiler and linker metadata toolkit
brew 'go-task'   # Task runner / simpler Make alternative

# Version Control
brew 'git'       # Distributed revision control system
brew 'gh'        # GitHub CLI
brew 'lazygit'   # Simple terminal UI for git commands

# Terminal Utilities
brew 'bat'       # Cat clone with syntax highlighting
brew 'bottom'    # Yet another cross-platform graphical process/system monitor
brew 'eza'       # Modern replacement for ls
brew 'fastfetch' # Like neofetch, but faster
brew 'fd'        # Simple, fast and user-friendly alternative to find
brew 'fzf'       # Command-line fuzzy finder
brew 'just'      # Handy way to save and run project-specific commands
brew 'mactop'    # macOS system monitor
brew 'oh-my-posh' # Prompt theme engine
brew 'rename'    # Perl-powered file reame script
brew 'ripgrep'   # Search tool like grep and The Silver Searcher
brew 'stow'      # Symlink farm manager
brew 'tmux'      # Terminal multiplexer
brew 'tree'      # Display directories as trees
brew 'zellij'    # Terminal workspace with batteries included
brew 'zoxide'    # Smarter cd command

# Text Editors
brew 'neovim'    # Ambitious Vim-fork focused on extensibility and usability
brew 'vim'       # Improved vi-style text editor

# Cloud and Infrastructure Tools
brew 'doctl'     # DigitalOcean CLI
brew 'encore'    # Backend development platform
brew 'railway'   # Railway CLI
brew 'supabase'  # Supabase CLI

# Database and Data Management
brew 'postgresql@14', restart_service: true # Object-relational database system
brew 'redis'     # Persistent key-value database
brew 'sqlite'    # Command-line interface for SQLite
brew 'sqlc'      # Generate type-safe code from SQL

# Networking and Security
brew 'ca-certificates' # Mozilla CA certificate store
brew 'curl' # Get a file from an HTTP, HTTPS or FTP server

# Image and Document Processing
brew 'poppler'   # PDF rendering library
brew 'tesseract' # OCR (Optical Character Recognition) engine
brew 'vips'      # Image processing library

# Go Development
brew 'golangci-lint' # Fast linters runner for Go
brew 'golines' # Go formatter that shortens lines

# JavaScript/Node.js Development
brew 'yarn' # JavaScript package manager

# Libraries and Dependencies
brew 'icu4c@76'  # C/C++ and Java libraries for Unicode
brew 'libxcrypt' # Extended crypt library
brew 'luajit'    # Just-In-Time Compiler for Lua
brew 'readline'  # Library for command-line editing
brew 'wimlib'    # Library to extract, create, and modify WIM files (file-based disk image format for Windows)

# Desktop Apps
cask '1password-cli'
cask 'ghostty'
cask 'slack@beta'

cask 'chatgpt'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'postman'
cask 'raycast'
cask 'zed@preview'
cask 'visual-studio-code'
cask 'logos'
cask 'claude'
cask 'docker'
